README.org
#+TITLE: Recent Mexican election vote returns repository
#+AUTHOR: Eric Magar Meurs
Last revision: 2024-02-29

----------

<h2>
Recent news
</h2>

<sup><sub>2024-04-12</sub></sup> Changed ~nl2018aymu~, ~mex2021aymu~, and ~mic2021aymu~ in source to reflect voided stations. Two victors changed in ~aymu1989-on.incumbents~ (in General Zuazua and Angangueo). Thanks to Juan Pablo Figueroa for pointing this.

<sup><sub>2024-02-29</sub></sup> Completes municipal /listas nominales/ for the study of turnout. 

# <sup><sub>2023-12-01</sub></sup> Electoral party/coalition of ayuntamiento incumbents added.

<sup><sub>2023-11-11</sub></sup> [[codebook][*Codebook*]] updated, with a printable flier.

<sup><sub>2023-05-26</sub></sup> *v.hat and alpha regressions*, summaring each unit's electoral history, migrated from [[https://github.com/emagar/mxDistritos]]. Despite relying on electoral maps to maintain unit geography longitudinally constant, these are statistics directly relevant to this repository's content. 
# Estimates and predictions for districts added, including predicted votes for the suspicious 1988 election, and the script for split secciones was finalized. 

<sup><sub>2023-03-10</sub></sup> *Inspect election returns online in Google sheets [[https://emagar.github.io/view-in-gSheets/][here]] (Beta)*

# <sup><sub>2023-02-22</sub></sup> *Voting station latitude/longitude* added for federal elections between 2006 and 2018 (excluding 2012, source needs debugging).

# <sup><sub>2022-11-18</sub></sup> *Casilla-level lista nominal* added to 1991-2003 federal deputy files.

# *Special municipal elections* in 2021/22 added, elected mayors updated. 

# *State-level presidential and senate returns* cleaned and updated.

# *Dzitbalché*, a new municipality in the state of Campeche, now has inegi code 4013.

# *Bug fixed* in fourth coalition vote aggregation/splitting (affected 5 municipalities only). 

# *Letters of intent* to run again for reelection (/cartas de intención/, see [[http://eleccionconsecutiva.diputados.gob.mx/contendientes][this]]) now systematized in ~data/dfdf1997-on.incumbents.csv~. See codebook below.

# *Reelection in 2021-22 info is here* ~data/aymu1989-on.incumbents.csv~ reports mayors reelected/beaten in states that dropped term limits in races concurrent with this year's midterm election. And ~data/dfdf1997-on.incumbents.csv~ does the same for federal deputies.

*New script* ~code/extract-state-yr-mu-returns.r~  exports municipal election returns. Focus in a single state-year allows votes received by each party across municipalities grouped in one column each --- easier to describe.  

----------

# Export to md: M-x org-md-export-to-markdown

* Description of /Recent Mexican Election Vote Returns/ repository<<top>>
- Author: Eric Magar
- Location https://github.com/emagar/elecRetrns
- Email: emagar at itam dot mx
- Citation for the data: see 'About' on the repository landing page
The repository contains voting data for recent Mexican elections for certain offices at different levels of aggregation. Data has been compiled from many sources. More recent years tend to be coded from official vote returns. Earlier elections tend to be from secondary sources (see Souces section). Data includes district-level federal deputy vote returns since 1979 and district-level presidential vote returns since 2006; and municipality-level municipal president vote returns (except in the state of Nayarit, votes cast for municipal president also elect a municipal council in a fused ballot). 

/Important note:/ older incarnations of this repository contain LFS (Large File System) files. Make sure to install [[https://git-lfs.github.com/][LFS]] in your machine before checking out older commits of the repository.
* How to cite the data
This repository is under the [[https://pitt.libguides.com/openlicensing/MIT][MIT license]] (see the LICENSE document for details). You are free to download and modify the data and code provided you give proper credit to this source. Unless otherwise noted in the file descriptor, the cite is Eric Magar (2018) Recent Mexican election vote returns repository, [[https://github.com/emagar/elecReturns]].
* File naming conventions
In general, file names identify the office elected (i.e., *df*, *se*, *pr*, *dl*, *go*, *ay* for /diputados federales/, /senadores/, /presidente/, /diputados locales/, /gobernador/, and /ayuntamiento/, respectively), followed by the unit of observation (i.e., *ed*, *df*, *dl*, *mu*, *de*, *se*, *ca* for /estado/, /distrito federal/, /distrito local/, /municipio/, /demarcación/, /sección electoral/, and /casilla/, respectively), then the years included.

So, for example ~aymu1970-on.csv~ are /ayuntamiento/ votes at the municipio level since 1970.
* Files in the repository
** Municipal office election returns
Municipal election data updated to 2022. Other than in the states of Chihuahua and Nayarit, municipal /ayuntamientos/ are elected in fused ballots for a /presidente municipal/ and a variable fraction of the municipal council (/regidores/ and /síndicos/). The other fraction of the municipal council is allocated by proportional representation. 

Chihuahua since 1998 also concurrently elects one /síndico/ per municipality in a separate ballot. The election is by plurality in the municipality at large. 

Nayarit since 2008 elects a fraction of municipal council members in single-member plurality districts called /demarcaciones/, the other fraction by proportional representation (ballot fused with the municipal president). 

Two versions of municipal election returns are included: one with votes reported by candidate, another reported by party (they may differ whenever coalitions competed). The script [[./code/ay.r][~code/ay.r~]] was used for these manipulations:
- [[./data/aymu1989-present.coalAgg.csv][~data/aymu1970-on.coalAgg.csv~]] = /ayuntamiento/ election returns, coalition votes aggregated by candidate.
- [[./data/aymu1989-present.coalSplit.csv][~data/aymu1970-on.coalSplit.csv~]] = /ayuntamiento/ election returns, coalition votes split among parties where source permits.
- [[./data/aymu1989-present.incumbents.csv][~data/aymu1989-on.incumbents.csv~]] = names of elected municipal officers (/presidente municipal/ only) since 1989. Includes reelection status since 2018.
*** Non-fused ballots (Chihuahua and Nayarit)
- [[./data/ay-nonfused/ayde2008-on-Nayarit-regid.coalAgg.csv][~data/ay-nonfused/aymu1998-on-Chihuahua-sind.csv~]] = Chihuahua /síndico/ election municipality-level returns since 1998, coalition votes aggregated by candidate.
- [[./data/ay-nonfused/ayde2008-on-Nayarit-regid.coalAgg.csv][~data/ay-nonfused/ayde2008-on-Nayarit-regid.coalAgg.csv~]] = Nayarit's municipal council election demarcación-level returns since 2008, coalition votes aggregated by candidate.
- [[./data/ay-nonfused/ayde2008-on-Nayarit-regid.coalSplit.csv][~data/ay-nonfused/ayde2008-on-Nayarit-regid.coalSplit.csv~]] = Nayarit's municipal demarcaciones vote returns since 2008, coalition votes split among parties where source permits.

