README.md
- [Description of *Recent Mexican Election Vote Returns* repository<a id="org8e7af36"></a>](#org8bfe523)
- [How to cite the data](#org814d4aa)
- [File naming conventions](#org94c65a0)
- [Files in the repository](#org6b49016)
  - [Municipal office election returns](#org727324e)
    - [Non-fused ballots (Chihuahua and Nayarit)](#org2f9febc)
    - [**Inspect data online** in Google sheets](#org2b38d33)
  - [Congressional election returns](#orgabb0522)
  - [Presidential election returns](#org77a459b)
  - [Gubernatorial election returns](#orge5c2587)
  - [Other](#org75bfa35)
- [Historical party performance statistics](#org320406b)
  - [Backwards predictions](#org3a6a560)
- [Codebook<a id="orga413288"></a>](#org243673c)
  - [Unit IDs](#org089cda5)
  - [Temporal IDs](#orga4da0b4)
  - [Voting](#org83b801b)
  - [Historical performance](#orgb5db57e)
  - [Candidates and incumbents](#org71b886b)
  - [Other](#org8d53e97)
- [Coding procedure for the incumbent's status<a id="orgf8ad454"></a>](#org7817dac)
- [Procedimiento para codificar el estatus del ocupante<a id="org10b6b4d"></a>](#orgbad3e2e)
- [Basic instructions to inspect data online:<a id="orgf6d6af1"></a>](#org8bbfcb9)
- [Sources](#org51f40e1)
- [Acknowledgements](#org4fbcc34)

Last revision: 2023-11-11

---

<h2> Recent news </h2>

<sup><sub>2023-11-11</sub></sup> [**Codebook**](#orga413288) updated, with a printable flier.

<sup><sub>2023-05-26</sub></sup> **v.hat and alpha regressions**, summaring each unit's electoral history, migrated from <https://github.com/emagar/mxDistritos>. Despite relying on electoral maps to maintain unit geography longitudinally constant, these are statistics directly relevant to this repository's content.

<sup><sub>2023-03-10</sub></sup> **Inspect election returns online in Google sheets [here](https://emagar.github.io/view-in-gSheets/) (Beta)**

<sup><sub>2023-02-22</sub></sup> **Voting station latitude/longitude** added for federal elections between 2006 and 2018 (excluding 2012, source needs debugging).

**New script** `code/extract-state-yr-mu-returns.r` exports municipal election returns. Focus in a single state-year allows votes received by each party across municipalities grouped in one column each &#x2014; easier to describe.

---


<a id="org8bfe523"></a>

# Description of *Recent Mexican Election Vote Returns* repository<a id="org8e7af36"></a>

-   Author: Eric Magar
-   Location <https://github.com/emagar/elecRetrns>
-   Email: emagar at itam dot mx
-   Citation for the data: see 'About' on the repository landing page

The repository contains voting data for recent Mexican elections for certain offices at different levels of aggregation. Data has been compiled from many sources. More recent years tend to be coded from official vote returns. Earlier elections tend to be from secondary sources (see Souces section). Data includes district-level federal deputy vote returns since 1979 and district-level presidential vote returns since 2006; and municipality-level municipal president vote returns (except in the state of Nayarit, votes cast for municipal president also elect a municipal council in a fused ballot).

*Important note:* older incarnations of this repository contain LFS (Large File System) files. Make sure to install [LFS](https://git-lfs.github.com/) in your machine before checking out older commits of the repository.


<a id="org814d4aa"></a>

# How to cite the data

This repository is under the [MIT license](https://pitt.libguides.com/openlicensing/MIT) (see the LICENSE document for details). You are free to download and modify the data and code provided you give proper credit to this source. Unless otherwise noted in the file descriptor, the cite is Eric Magar (2018) Recent Mexican election vote returns repository, <https://github.com/emagar/elecReturns>.


<a id="org94c65a0"></a>

# File naming conventions

In general, file names identify the office elected (i.e., **df**, **se**, **pr**, **dl**, **go**, **ay** for *diputados federales*, *senadores*, *presidente*, *diputados locales*, *gobernador*, and *ayuntamiento*, respectively), followed by the unit of observation (i.e., **ed**, **df**, **dl**, **mu**, **de**, **se**, **ca** for *estado*, *distrito federal*, *distrito local*, *municipio*, *demarcación*, *sección electoral*, and *casilla*, respectively), then the years included.

So, for example `aymu1970-on.csv` are *ayuntamiento* votes at the municipio level since 1970.


<a id="org6b49016"></a>

# Files in the repository


<a id="org727324e"></a>

## Municipal office election returns

Municipal election data updated to 2022. Other than in the states of Chihuahua since 1998 and Nayarit since 2008, municipal *ayuntamientos* are elected in fused ballots for a *presidente municipal* and a variable fraction of the municipal council (*regidores* and *síndicos*). The other fraction of the municipal council is allocated by proportional representation.

Chihuahua since 1998 also concurrently elects one *síndico* per municipality in a separate ballot. The election is by plurality in the municipality at large.

Nayarit elects a fraction of municipal council members in single-member plurality districts called *demarcaciones*, the other fraction by proportional representation (ballot fused with the municipal president).

Two versions of municipal election returns are included: one with votes reported by candidate, another reported by party (they may differ whenever coalitions competed). The script [`code/ay.r`](./code/ay.r) was used for these manipulations:

-   [`data/aymu1970-on.coalAgg.csv`](./data/aymu1989-present.coalAgg.csv) = *ayuntamiento* election returns, coalition votes aggregated by candidate.
-   [`data/aymu1970-on.coalSplit.csv`](./data/aymu1989-present.coalSplit.csv) = *ayuntamiento* election returns, coalition votes split among parties where source permits.
-   [`data/aymu1989-on.incumbents.csv`](./data/aymu1989-present.incumbents.csv) = names of elected municipal officers (*presidente municipal* only) since 1989. Includes reelection status since 2018.


<a id="org2f9febc"></a>

### Non-fused ballots (Chihuahua and Nayarit)

-   [`data/ayde2008-on-Nayarit-regid.coalAgg.csv`](./data/ayde2008-on-Nayarit-regid.coalAgg.csv) = Nayarit's municipal council election demarcación-level returns since 2008, coalition votes aggregated by candidate.
-   [`data/ayde2008-on-Nayarit-regid.coalSplit.csv`](./data/ayde2008-on-Nayarit-regid.coalSplit.csv) = Nayarit's municipal demarcaciones vote returns since 2008, coalition votes split among parties where source permits.
