README.org
*** *Inspect data online* in Google sheets
Basic instructions [[instrucciones][here]]; data split by approximate decades or groups of states to comply with spreadsheet size limits (400k cells); files have identical columns to ease appending one another off Google drive:
    - ~*.coalAgg~ versions: [[https://docs.google.com/spreadsheets/d/10DjanWnuvGUqO8AFDb3yky8Pa7ciMhf_MbthCmKCloI/copy][1970s]] [[https://docs.google.com/spreadsheets/d/1hqAyWaewUKwA-CKgXgcg-p4aqPQxmuTbxmcKSQgjfDE/copy][1980s]] [[https://docs.google.com/spreadsheets/d/1nwEO4u4ddn4kGlHUM9dc-ueD6L7IXXkLNHRBDPrB9Nk/copy][1990s]] [[https://docs.google.com/spreadsheets/d/1WBmHm1yqgXO6qjj8czROZNcZNS_G82Z-UT0vtTxSVFI/copy][2000s]] [[https://docs.google.com/spreadsheets/d/1TgdTRdN5wqLPdV4j2CvvhvsXbFnMFMSho653XQHQsNs/copy][2010s]] [[https://docs.google.com/spreadsheets/d/1jXzjWBfQrpFTHahXDW9i3nyFL0bjYqSeIMwS-CGA3KQ/copy][2020s]] [[https://docs.google.com/spreadsheets/d/1buoVi7UlVPoApm7nan-ixb3ts8Sraj_V86mK-3UeH3w/copy][Nayarit]]
    - ~*.coalSplit~ versions : [[https://docs.google.com/spreadsheets/d/10xIcX83xTi-YI1PmdmdpTGpItBtwndOZILZZugdMpVo/copy][1970s]] [[https://docs.google.com/spreadsheets/d/1yqCFBtr8Z2sCya7CT9LMPifU_kA4wlqSTLjrW-KiALc/copy][1980s]] [[https://docs.google.com/spreadsheets/d/1rE5KHwvuVglV0rLI70P4PgtOmWSiUGtS92G4QbN4zz0/copy][1990s]] [[https://docs.google.com/spreadsheets/d/1GgG7SSeJptJ-uGmIgBck3mniL2HR1gn6efebBMlEpXQ/copy][2000s]] [[https://docs.google.com/spreadsheets/d/1nKyNzZuLyDWxqIfC6MiRDmvzligGQ2v_YrqppcEVa1Q/copy][2010s]] [[https://docs.google.com/spreadsheets/d/1xg9GvjPzOq7TxxkkebMGuOBz50WU_RVEaadLsIWRWHU/copy][2020s]] [[https://docs.google.com/spreadsheets/d/1C2OvOsSBaOqMOj1KEV6F2dgq0fGBwLJJYSnvBKpmTkM/copy][Nayarit]]
    - ~incumbents~: [[https://docs.google.com/spreadsheets/d/1_yNb-5TEvPkCupy1AvUwLL79emfLQfI6J00pfx97Ir4/copy][Aguascalientes (1)--Jalisco (14)]] [[https://docs.google.com/spreadsheets/d/1lgJJ2f8O_MHe18q3OekRylgxOXpKGrcm6ABQPVhmlf4/copy][México (15)--Puebla (21)]] [[https://docs.google.com/spreadsheets/d/1ZabVHORN0uOU8AX7bZGiQY1JEhncG6SodLfn6DXW4zQ/copy][Querétaro (22)--Zacatecas (32)]]
** Congressional election returns
Congressional election data updated to 2021. A mixed majority system is in place since 1979 for the chamber of deputies, since 1997 for the senate (Weldon 2001 describes the system well). 300 deputy seats are elected by plurality rule in single member districts. Two versions of federal deputy returns are included: one with district votes aggregated by candidate, another by party (the script [[./code/ay.r][~code/df.r~]] was used for these manipulations):

*Citation for Congressional election data*: Eric Magar, Alejandro Trelles, Micah Altman, and Michael P. McDonald (2017) Components of partisan bias originating from single-member districts in multi-party systems: An application to Mexico, /Political Geography/ 57(1):1-12. 
- [[./data/dfdf1979-on.coalAgg.csv][~data/dfdf1979-on.coalAgg.csv~]]     = federal deputy returns, coalition votes aggregated by candidate.
- [[./data/dfdf1979-on.coalSplit.csv][~data/dfdf1979-on.coalSplit.csv~]]   = federal deputy returns, coalition votes split among parties where source permits.
- [[./data/dfdf1979-on.coalSplit.csv][~data/dfdf1997-on.incumbents.csv~]]  = names of elected federal deputies (SMD tier only) since 1997. Includes reelection status since 2021.
- [[./data/dfdf2006-on-candidates.csv][~data/dfdf2006-on-candidates.csv~]]  = names of all federal deputy candidates in districts and party lists since 2006. 
- [[./data/seed2012-on.candidates.csv][~data/seed2012-on.candidates.csv~]]  = names of all senatorial candidates in states and party lists since 2012. 
- *Inspect the data above online* in Google sheets (basic instructions [[instrucciones][here]]):
  + [[https://docs.google.com/spreadsheets/d/1cUfi1BlpVVeBKo-vI2lbQAwtUGpGFlGAqcdHZ01BtRo/copy][~coalAgg~]] version
  + [[https://docs.google.com/spreadsheets/d/1c57io0aooj54elYxw2Ya0QO1_tRWd-QWadKYCLU3CiA/copy][~coalSplit~]] version 
  + [[https://docs.google.com/spreadsheets/d/1r6BER0cmm4MNwNiy7ZdAwALzQn9QiEGg_9TfALumbPU/copy][~incumbents~]]
** Presidential election returns
Presidential election data updated to 2018. Presidents elected by plurality in a nationwide race every six years.

*Citation for the presidential dataset*: Eric Magar (2012) Gubernatorial Coattails in Mexican Congressional Elections, /The Journal of Politics/ 74(2):383-399.
- [[./data/prdf2006-on.csv][~data/prdf2006-on.csv~]]
- [[./data/pred1964-on.csv][~data/pred1964-on.csv~]]
** Gubernatorial election returns
*Citation for the gubernatorial dataset*: Eric Magar (2012) Gubernatorial Coattails in Mexican Congressional Elections, /The Journal of Politics/ 74(2):383-399.
- [[./data/goed1961-on.csv][~data/goed1961-on.csv~]] = governor statewide election returns since 1961, updated to 2022.
- [[./data/goed1970-on.incumbents.csv][~data/goed1970-on.incumbents.csv~]] = elected governors since 1970, updated to 2022.
** Other
# - [[./code/ayClean.r][~code/ayClean.r~]] = script used to clean /ayuntamiento/ returns, should be unnecessary unless new data are added because output has been saved into csv file.
- [[./code/extract-state-yr-mu-returns.r][~code/extract-state-yr-mu-returns.r~]] = script exports municipal coalition-aggregates election returns. Select one state and year to get csv file with votes received by each party across municipalities grouped in one column each. 
- [[./datosBrutos/][~datosBrutos/~]] = directory containing selected primary sources. Files for state elections were kept out from the repository due to sizes exceeding github's limit... [[mailto:emagar@itam.mx][e-mail me]] if you need any of these.
[[top][<sub>Back to top</sub>]]
