README.org
* Historical party performance statistics
Measures of recent electoral history, that [[https://emagar.github.io/residuales-2018-english/][this blog entry]] describes, offer indicators of party competitiveness at different units of aggregation. This includes quantities of substantive interest, such as parties' predicted vote share in the unit (~v.hats~) based on their performance in the previous five congressional elections, and how sensitive the party's vote share in the unit is to national vote swings (~alphas~) between 1994 and 2021.
| Level             | 2009     | 2012     | 2015     | 2018     | 2021     | 2024     |
|-------------------+----------+----------+----------+----------+----------+----------|
| District          | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-2009.csv][csv]] [[https://docs.google.com/spreadsheets/d/1E9hffMdeTqOG5V8z7YEwCRRvazpYaj5HSa5xqOn4WJs/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-2012.csv][csv]] [[https://docs.google.com/spreadsheets/d/1vze9n0HwIw8RC68Ie6lRB1x-pgg0purapbF04iywKdc/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-2015.csv][csv]] [[https://docs.google.com/spreadsheets/d/1YM8g_tmfNtnyJQva6N6HH6NnLa2Si40amO9di40lw8c/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-2018.csv][csv]] [[https://docs.google.com/spreadsheets/d/1xP4ABf7VvSLefRRyScdBxVGarWOr_hYZK956hIPZkIY/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-2021.csv][csv]] [[https://docs.google.com/spreadsheets/d/1Oce9stn05v9M-T8YusF2d7nPxy3J8_OqRVdiDnOI9mQ/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-2024.csv][csv]] [[https://docs.google.com/spreadsheets/d/1p-EH1pahzgoMgF6yVpFp-_L6Byma0ZmBUfi0e1zanl0/copy][view]] |
| Municipio         | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-2009.csv][csv]] [[https://docs.google.com/spreadsheets/d/1Y3VipbSzmhbfWUXBnNVHGS8mDjHxaEW1lYoccQ9tr48/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-2012.csv][csv]] [[https://docs.google.com/spreadsheets/d/1LwuFkzPVLVwL2kkOEBBz54g7ZDM6RMJ4mlQv7awIDtg/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-2015.csv][csv]] [[https://docs.google.com/spreadsheets/d/18XlMxG4HN_vrDdyPYtqJbQXKpM-1LR5MVq598Any2nw/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-2018.csv][csv]] [[https://docs.google.com/spreadsheets/d/1L9SeCXUpHkhk4K1Xagv34Z65i8WvmW9E-ApeNB36_v4/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-2021.csv][csv]] [[https://docs.google.com/spreadsheets/d/14vSmGXfQc5BXvZ32nKAVyaQdDV1dz6cXgL1MGMxxt94/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-2024.csv][csv]] [[https://docs.google.com/spreadsheets/d/13FnRerpuxIM-RZfgzkjUiPXKPKL1JACkBIk0oa2kSfI/copy][view]] |
| Sección electoral | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-2009.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-2012.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-2015.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-2018.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-2021.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-2024.csv][csv]]      |
