README.org
** Backwards predictions
Vote returns prior to 1991 are unavailable at lower units of aggregation. Pre-2009 ~v.hats~ are obtained by using same general approach, but backwards, "predicting" from subsequent party performance. Year t's predicted vote (up to 2006) is a linear projection of the unit's vote in the next five elections (years t+15, t+12 ... t+3). 
| Level             | 1988     | 1991     | 1994     | 1997     | 2000     | 2003     | 2006     |
|-------------------+----------+----------+----------+----------+----------+----------+----------|
| District          | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-19.csv][csv]] [[https://docs.google.com/spreadsheets/d/1KL3Cu9B-xvMSkyc0FLosi69xns7Pk6yx8zdyU-aLkhw/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-19.csv][csv]] [[https://docs.google.com/spreadsheets/d/1eU_LXZhj-Lcd4E2OdJUj-w3yBIkWovXZFK7RPtqy08E/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-19.csv][csv]] [[https://docs.google.com/spreadsheets/d/1CPkki2zC5KnsNu-iuY3j4WRVv1eZooyjB6UWf3JXQTI/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-19.csv][csv]] [[https://docs.google.com/spreadsheets/d/1BWnGr8jtI6ezdK1ZQIIRhnY7ACI8mcPf5weF5z97tho/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-20.csv][csv]] [[https://docs.google.com/spreadsheets/d/1_Qx5trIPmc5oAhXBNRHl_fOR92JYTpXE4y6YpNN1Yss/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-20.csv][csv]] [[https://docs.google.com/spreadsheets/d/1ONYLsWjmNxzY0h2p0x_waYUYditYF2lO0rDaONzwihY/copy][view]] | [[./data/v-hats-etc/dis/dipfed-distrito-vhat-20.csv][csv]] [[https://docs.google.com/spreadsheets/d/1CZ2pzL3g4XcAnPeWs-TFh9m3qK0iaJX_z9cvhWjCzWk/copy][view]] |
| Municipio         | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-19.csv][csv]] [[https://docs.google.com/spreadsheets/d/1kKC6rnp9rgXTv6aEQSvvGT9NY5J3J6D1UtNiJOwEJgo/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-19.csv][csv]] [[https://docs.google.com/spreadsheets/d/1JrjGS1pZ0CrDcjFd23RUTMdosOwWce568ra2E1pQxu4/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-19.csv][csv]] [[https://docs.google.com/spreadsheets/d/1Y01BdrOr15ei2pDeGrXtTEz6nqP6IS-USvoiZLoXWqk/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-19.csv][csv]] [[https://docs.google.com/spreadsheets/d/1ulwgVYCbgQeC_5FuXCYkilP6yfpPc69NR_gZpXf6QEM/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-20.csv][csv]] [[https://docs.google.com/spreadsheets/d/1M90-ZuW3SRnqxfRjboeWWvU2wt-YPnlp7nT4n7fM6zI/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-20.csv][csv]] [[https://docs.google.com/spreadsheets/d/1ky0Eris0cU3OaEA35kQPhjEsR_kxilWnx-iEun8D06M/copy][view]] | [[./data/v-hats-etc/mun/dipfed-municipio-vhat-20.csv][csv]] [[https://docs.google.com/spreadsheets/d/1HfzYxOxRcFfVgJivvX7nYeaiMbILM7ePAGSbL_jcv74/copy][view]] |
| Sección electoral |          | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-19.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-19.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-19.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-20.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-20.csv][csv]]      | [[./data/v-hats-etc/sec/dipfed-seccion-vhat-20.csv][csv]]      |
[[top][<sub>Back to top</sub>]]
* Codebook<<codebook>>
Most variables are included in all files. Refer here for guidance. Printable codebook [[file:./codebook-flier.pdf][here]]. 
** Unit IDs
- /edon/ = state numeral 1:32.
- /edo/ = state abbreviation (may differ from commonly used abbreviations, eg. Chiapas is `cps' instead of `chis', so that sorting alphabetically preserves the order set by /edon/).
- /disn/ = district identifier = /edon/ * 100 + two digit district numeral.
- /cab/ = cabecera, district's administrative center.
- /inegi/, /ife/ = municipal identifier codes used by the INEGI and the IFE/INE, respectively.
- /mun/ = municipality's name.
- /emm/ = unit's identifying code. It concatenates the state's /edo/ abbreviation (then a hyphen) two sequential digits for the election cycle (then a period) and, depending on the level of observation, the /inegi/ or district identifier. Using /emm/ as sort criterion returns a state-time-unit ordering.
- /demar/ = demarcación identifier = /inegi/ + 1/100 demarcación numeral (used for Nayarit municipal elections only).
- /seccion/ = voting precinct identifier = /edon/ * 10000 + sección electoral numeral (as set by IFE/INE).
- /casilla/ = polling station identifier (as set by IFE/INE). There are four types of stations, coded B for /Básica/, C for /Contigua/, E for /Extraordinaria/, and S for /Especial/. See IFE's own description [[https://portalanterior.ine.mx/archivos2/Alterna/2016/PREP/CentroDeAyuda/Extraordinaria/rsc/pdf/tipos_casillas.pdf][here]].
# - /circ/ = secondary, proportional representation congressional district (/circunscripción plurinominal/) to which the primary congressional district belongs to. 
- /latitude/, /longitude/ = coordinates indicating a polling booths's north--south and east--west position in a map. Available for federal casilla-level returns in the 2006, 2009, 2015, and 2018 elections. 
** Temporal IDs
- /yr/, /mo/, /dy/ = year, month, day of the election. 
- /date.el/, /date.in/ = date of the election and start of term, respectively.
- /dextra/ = dummy equal 1 for special elections (/elección extraordinaria/), 0 otherwise.
- /danul/ = dummy equal 1 for voided elections, 0 otherwise.
