README.md


<a id="org83b801b"></a>

## Voting

-   *v01*, *v02*, &#x2026; = raw vote for candidate 1, 2, etc.
-   *l01*, *l02*, &#x2026; = label of candidate 1's, 2's, &#x2026; party or coalition.
-   *c01*, *c02*, &#x2026; = candidate 1's, 2's, &#x2026; name.
-   *efec* = effective vote total, the sum of raw votes minus votes for write-in candidates minus invalid ballots. It is the denominator to compute vote shares.
-   *lisnom* = unit's total eligible voters (*lista nominal*).
-   *nr* = votes for write-in candidates (*candidatos no registrados*, void in Mexican election law).
-   *nul*, *nulos* = invalid ballots (*votos nulos*).
-   *tot* = total raw votes.
-   *win* = winner's party or coalition.
-   *ncand* = number of candidates running.

-   *ncoal* = number of candidates who ran on multi-party pre-electoral coalitions.

-   *dfake* = indicates an attempt to complete missing hegemonic era races (mostly in the 1960s and 70s) for the purpose of computing vote lags, made up of press reports and best guesses about what happened in the state's race.


<a id="orgb5db57e"></a>

## Historical performance

-   *d.pan*, *d.pri*, *d.left* = first difference in the party's federal deputy vote share from last to present election.
-   *vhat.pan*, *vhat.pri*, *vhat.left* = predicted federal deputy vote share in the unit for the current election, a linear projection of the last five races.
-   *bhat.pan*, *bhat.left* = slope estimate of the party's autoregressive linear model for the unit. The PRI used as reference vote and has no slope estimate.
-   *alphahat.pan*, *alphahat.pri*, *alphahat.left* = party's *alpha* estimated for the unit.
-   *betahat.pan*, *betahat.left* = party's *beta* estimate for the unit. The PRI used as reference vote and has no *beta* estimate.
-   *dbackward* = dummy equal 1 if prediction with autoregressive model performed backwards, 0 otherwise.


<a id="org71b886b"></a>

## Candidates and incumbents

-   *incumbent*, *runnerup* = winning and runner-up candidates' names.
-   *propietario*, *suplente* = primary and substitute candidate's name, respectively.
-   *part*, *pty* = incumbent/candidate's party or coalition.
-   *part.2nd* = runner-up party or coalition.
-   *mg* = winner's margin = winner's vote share minus runner-up's vote share.
-   *dmujer* = dummy equal 1 if candidate/incumbent is a woman, 0 otherwise.
-   *race.after* = incumbent's status in the next consecutive race. See [this](#orgf8ad454) for categories and coding procedure ([aquí](#org10b6b4d) la versión en castellano del procedimiento codificador).
-   *dreran* = dummy equal 1 if incumbent ran again in the next consecutive race for the same office.
-   *dreelected* = dummy equal 1 if incumbent won the next consecutive race for the same office.
-   *dcarta* = dummy equal 1 if member of Congress filed a letter of intent with the chamber's Junta to run for office again; 0 otherwise. Inapplicable before 2018. See [this](http://eleccionconsecutiva.diputados.gob.mx/contendientes).
-   *lista* = candidate's rank in senate two-member party lists. Top member of runner-up vote-getting list wins the state's third senate seat.
-   *drp* = dummy equal 1 if candidate ran for a PR seat, 0 otherwise.
-   *ddied* = dummy equal 1 if incumbent died in office, 0 otherwise.


<a id="org8d53e97"></a>

## Other

-   *nota* = observations possibly relevant for analysis.
-   *fuente*, *source* = sources.

[<sub>Back to top</sub>](#org8e7af36)


<a id="org7817dac"></a>

# Coding procedure for the incumbent's status<a id="orgf8ad454"></a>

In files `data/aymu1985-on.incumbents.csv` and `data/dfdf1997-on.incumbents.csv`, variable *race.after* reports what occured at the end of the incumbent's term. It takes one of the following categories:

1.  \`Reran-beaten' = the incumbent re-ran and lost;
2.  \`Reelected' = the incumbent re-ran and won;
3.  \`Dead' = the incumbent died in office;
4.  \`Hi-office' = the incumbent ran for higher office in the next cycle;
5.  \`Out' = the incumbent withdrew or was not renominated in the next cycle;
6.  \`Term-limited' = incumbent ineligible for reelection due to a term limit;
7.  \`Uyc' = municipio quit the popular election of authorities in the next cycle, appointing offices according to community rules (*usos y costumbres*);
8.  A year numeral = still early to know the incumbent's status (and the year of the next race).

In categories other than the first two above, a suffix may be present:

-   Suffix '-p-lost' indicates that the party lost the subsequent race (or, in case of incumbents elected by a multi-party coalition, that none of them won or was part of the winning coalition).
-   Suffix '-p-won' indicates that the party won the subsequent race (or, in case of incumbents elected by a multi-party coalition, that one of them won or at least one of them was in the winning coalition).

[<sub>Back to top</sub>](#org8e7af36)


<a id="orgbad3e2e"></a>

# Procedimiento para codificar el estatus del ocupante<a id="org10b6b4d"></a>

En el archivo `data/aymu1985-on.incumbents.csv`, la variable *race.after* indica el estatus del ocupante en la elección subsecuente. El estatus puede ser una de las categorías siguientes:

1.  \`Reran-beaten' = el ocupante volvió a contender y perdió;
2.  \`Reelected' = el ocupante volvió a contender y ganó;
3.  \`Dead' = el ocupante falleció durante su mandato;
4.  \`Hi-office' = el ocupante contendió el siguiente ciclo por otro cargo de elección (p.ej. gobernador o senador);
5.  \`Out' = el ocupante se retiró o no fue repostulado por el partido;
6.  \`Term-limited' = el ocupante estaba constitucionalmente impedido para aspirar a reelegirse consecutivamente;
7.  \`Uyc' = el muicipio abandonó en el siguiente ciclo la elección popular de sus autoridades, nombrándolos según usos y costumbres;
8.  Un número de año = aún es prematuro conocer el estatus (y el año de la próxima elección).

En las categorías 3 en adelante, un sufijo puede estar presente:

-   El sufijo '-p-lost' indica que el partido perdió la elección subsecuente (o, para ocupantes electos por una coalición multi-partidista, que ninguno de esos partidos ganó o fue parte de la coalición ganadora).
-   El sufijo '-p-won' indica que el partido ganó la elección subsecuente (o, para ocupantes electos por una coalición multi-partidista, que uno de esos partidos ganó o que por lo menos uno fue parte de la coalición ganadora).

[<sub>Back to top</sub>](#org8e7af36)


<a id="org8bbfcb9"></a>

# Basic instructions to inspect data online:<a id="orgf6d6af1"></a>

You can open election returns in online spreadsheet form.

a. To use this feature, you must first log into a Google account. Then click the desired file's link, and confirm you wish a copy. A Google spreadsheet will open in your browser.

b. If you wish to manipulate the data (eg. re-sorting rows by year or keeping a subset of the observations only), or save the file to your hard drive, you must unlink the data from the repository. To do this type CTRL+A (ie., select all) then CTRL+SHIFT+V (ie., paste values only).

c. Linked data updates about every hour. If a refresh were needed sooner, erase the function in cell A1 and undo the change. [<sub>Back to top</sub>](#org8e7af36)
