README.org
* Sources
Work in progress
- /Fuente/ = iee/ife/ine indicates data obtained from the primary source, the state/federal election board's web site. 
- /Fuente/ = tesis Melissa
- /Fuente/ = Magar 1994
- /Fuente/ = Mexico Electoral Banamex
- /Fuente/ = Toledo Patiño paper
- /Fuente/ = UAM Iztapalapa for older state races
- /Fuente/ = voz y voto
* Acknowledgements
Eric Magar acknowledges financial support from the Asociación Mexicana de Cultura A.C., and is fully responsible for mistakes and shortcomings in the data and code. 

Many students over the years have provided research assistance, retrieving and systematizing some of the information reported here. 
- Daniela Guzmán Lerma
- Eugenio Solís Flores
- [[http://franciscogarfias.com/][Francisco Garfias]]
- [[https://github.com/pptrrns][José Angel Torrens Hernández]]
- Julio Solís Ríos
- [[https://polisci.wustl.edu/people/lucia-motolinia][Lucía Motolinia Carballo]]
- [[https://www.mauriciofduque.com/][Mauricio Fernández Duque]]
- Odette González Carrillo
- [[https://tec.mx/es/facultad-de-impacto/roberto-ponce][Roberto Ponce López]]
- Sonia Kuri Kosegarten
- [[https://github.com/VidalTinoco][Vidal Mendoza Tinoco]]

[[top][<sub>Back to top</sub>]]
