README.md


<a id="org51f40e1"></a>

# Sources

Work in progress

-   *Fuente* = iee/ife/ine indicates data obtained from the primary source, the state/federal election board's web site.
-   *Fuente* = tesis Melissa
-   *Fuente* = Magar 1994
-   *Fuente* = Mexico Electoral Banamex
-   *Fuente* = Toledo Patiño paper
-   *Fuente* = UAM Iztapalapa for older state races
-   *Fuente* = voz y voto


<a id="org4fbcc34"></a>

# Acknowledgements

Eric Magar acknowledges financial support from the Asociación Mexicana de Cultura A.C., and is fully responsible for mistakes and shortcomings in the data and code.

Many students over the years have provided research assistance to retrieve and systematize the information reported here.

-   **Under construction**
-   Daniela Guzmán Lerma
-   Eugenio Solís Flores
-   Francisco Garfias
-   José Angel Torrens Hernández
-   Julio Solís Ríos
-   Lucía Motolinia
-   Mauricio Fernández Duque
-   Odette González Carrillo
-   Sonia Kuri Kosegarten
-   Vidal Mendoza Tinoco

[<sub>Back to top</sub>](#org8e7af36)
